#include <iostream>
// KoreloKseniya2003 
// предсавление строки в Widows-1251 ( 004B 006F 0072 0065 006C 006F 004B 0073 0065 006E 0069 006A 0061 0032 0030 0030 0033 )
// в UTF-8 ( \u004b\u006f\u0072\u0065\u006c\u006f\u004b\u0073\u0065\u006e\u0069\u0061\u0061\u0032\u0030\u0030\u0033 )
// в UTF-16 ( \u004b\u006f\u0072\u0065\u006c\u006f\u004b\u0073\u0065\u006e\u0069\u0061\u0061\u0032\u0030\u0030\u0033 )

// КорелоКсения2003
// предсавление строки в Widows-1251 ( 041A 043E 0440 0435 043B 043E 041A 0441 0435 043D 0438 044F 0032 0030 0030 0033 )
// в UTF-8 ( \u041a\u043e\u0440\u0435\u043b\u043e\u041a\u0441\u0435\u043d\u0438\u044f\u0032\u0030\u0030\u0033 )
// в UTF-16 ( \u041a\u043e\u0440\u0435\u043b\u043e\u041a\u0441\u0435\u043d\u0438\u044f\u0032\u0030\u0030\u0033 )

// Корело2003Kseniya
// предсавление строки в Widows-1251 ( 041A 043E 0440 0435 043B 043E 0032 0030 0030 0033 004B 0073 0065 006E 0069 006A 0061 )
// в UTF-8 ( \u041a\u043e\u0440\u0435\u043b\u043e\u0032\u0030\u0030\u0033\u004b\u0073\u0065\u006e\u0069\u0061 )
// в UTF-16 ( \u041a\u043e\u0440\u0435\u043b\u043e\u0032\u0030\u0030\u0033\u004b\u0073\u0065\u006e\u0069\u0061 )

int main()
{
	int number = 0x12345678;
	char hello[] = "Hello, ";
	char lfie[] = "KoreloKseniya2003";
	char rfie[] = "КорелоКсения2003";
	char lr[] = "Корело2003Kseniya";

	wchar_t Lfie[] = L"KoreloKseniya2003";
	wchar_t Rfie[] = L"КорелоКсения2003";
	wchar_t LR[] = L"Корело2003Kseniya";

	std::cout << hello << lfie << std::endl;
	return 0;
}