use K_MyBase;
INSERT into Products ( Products_Name, Название_товара, Описcание, Цена)
Values (12,'Товар 1','хрупкий', 43), (34,'Товар 2','не хрупкий', 28), (15,'Товар 3',' не хрупкий', 80), (83,'Товар 4','хрупкий', 10);

INSERT into Заказчик (Номер_отдела, Название_отдела, Количество_сотрудников)
Values (1, 'potatos', 34), (2, 'finger', 567), (3, 'lumus', 132), (4, 'soup', 7);

INSERT into Заказы (Номер_чека, Номер_отдела, Номер_товара, Дата, Потраченная_сумма)
Values (2356, 1, 12, '2022-10-08', 45.5), (45768, 2, 15, '2022-10-02', 90), (23497, 4, 83, '2022-09-16', 12.3),
(9875, 1, 34, '2022-08-20', 30), (9876, 3, 12, '2022-06-13', 56.8);